# Программа принимает действительное положительное число x и целое отрицательное число y.
# Необходимо выполнить возведение числа x в степень y. Задание необходимо реализовать в виде функции my_func(x, y).
# При решении задания необходимо обойтись без встроенной функции возведения числа в степень.

# Подсказка: попробуйте решить задачу двумя способами. Первый — возведение в степень с помощью оператора **.
# Второй — более сложная реализация без оператора **, предусматривающая использование цикла.


def my_func_1(x, y):
    return x**y


def my_func_2(x, y):
    val = 1
    for i in range(abs(y)):
        val *= x
    return 1/val


print(my_func_1(12, -9))
print(my_func_2(12, -9))
